# Trucos con Panda

## Probando todos los trucos

### ¿Campo de aplicación de la librería Pandas?

Pandas es una librería de Python especializada en el manejo y análisis de estructuras de datos.

Define nuevas estructuras de datos basadas en los arrays de la librería NumPy pero con nuevas funcionalidades.

Permite trabajar con series temporales.

In [42]:
import pandas as pd
from pandas import ExcelWriter

## Estructura de datos de Pandas

## Series

In [3]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

## DataFrame

In [4]:
 data = {'Country': ['Belgium', 'India', 'Brazil'], 
 'Capital': ['Brussels', 'New Delhi', 'Brasília'],
 'Population': [11190846, 1303171035, 207847528]}

In [5]:
df = pd.DataFrame(data, 
 columns=['Country', 'Capital', 'Population'])

In [6]:
print(df)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

 ## I/O

### Leer y escribir CSV

In [12]:
pd.read_csv('archivoSVC.csv', header=None, nrows=5)

    0       1
0  10    juan
1  90  miguel
2  20  teresa

In [10]:
 df.to_csv('myDataFrame.csv')

### Leer y escribir a excel

In [14]:
pd.read_excel('datos.xlsx')

   M Miguel
0  J  Juana
1  L   Luis

In [56]:
writer = ExcelWriter('ejemplo.xlsx')

In [63]:
df.to_excel(writer)

In [64]:
writer.save()

#### Leer multiples hojas del mismo archivo

In [68]:
xlsx = pd.ExcelFile('ejemplo.xlsx')

In [80]:
df = pd.read_excel('ejemplo.xlsx', index_col = 0)
print(df)

           Capital  Population
Country
Belgium   Brussels    11190846
India    New Delhi  1303171035
Brazil    Brasília   207847528

## Pidiendo ayuda

In [53]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`

    Raises
    ------
    KeyError:
        when any items are not found

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

## Selección

### Obteniendo

In [41]:
s['b']
#Obteniendo un elemento del arreglo b

-5

### Obtener subconjunto de un DataFrame

In [51]:
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

### Selección, indexación booleana y configuración

#### Seleccionar un valor por fila y columna (por posición)

In [114]:
 df.iloc[0], [0]

(Capital       Brussels
 Population    11190846
 Name: Belgium, dtype: object, [0])

In [162]:
df.iat[0,0]

'Brussels'

#### Seleccionar un valor por label de fila y label de columna (por label)

In [213]:
#df.loc([0], ['Country'])

In [212]:
#df.at([0], ['Country'])

#### Seleccionar una sola fila de subconjunto de filas (Por label, y posición)

In [207]:
df.iloc[2]

Capital        Brasília
Population    207847528
Name: Brazil, dtype: object

In [211]:
#df.ix[1,'Capital']

#### Indexación booleana

In [215]:
s[~(s > 1)]

b   -5
dtype: int64

In [216]:
s[(s < -1) | (s > 2)]

a    3
b   -5
c    7
d    4
dtype: int64

In [217]:
df[df['Population']>1200000000]

           Capital  Population
Country
India    New Delhi  1303171035

#### Ajustes

In [222]:
s['a'] = 6

## Leer y escribir a SQL or tabla de base de datos

In [4]:
from sqlalchemy import create_engine
import pandas as pd

In [5]:
engine = create_engine('sqlite:///:memory:')

In [9]:
pd.read_sql("SELECT *FROM Personas;", engine)

OperationalError: (sqlite3.OperationalError) no such table: my_table
[SQL: SELECT *FROM my_table;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [8]:
pd.read_sql_table('Personas', engine)

ValueError: Table Personas not found

In [10]:
pd.to_sql('myDf', engine)

AttributeError: module 'pandas' has no attribute 'to_sql'

## Borrando

In [228]:
 s.drop(['a', 'c'])

b   -5
d    4
dtype: int64

In [231]:
 #df.drop('Country', axis=0)

## Ordenar y rank

In [232]:
df.sort_index()

           Capital  Population
Country
Belgium   Brussels    11190846
Brazil    Brasília   207847528
India    New Delhi  1303171035

In [233]:
 df.sort_values(by='Country')

           Capital  Population
Country
Belgium   Brussels    11190846
Brazil    Brasília   207847528
India    New Delhi  1303171035

In [234]:
df.rank()

         Capital  Population
Country
Belgium      2.0         1.0
India        3.0         3.0
Brazil       1.0         2.0

## Recuperación de información de series/dataframes

### Información básica

In [236]:
df.shape

(3, 2)

In [237]:
df.index

Index(['Belgium', 'India', 'Brazil'], dtype='object', name='Country')

In [238]:
df.columns

Index(['Capital', 'Population'], dtype='object')

In [239]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Belgium to Brazil
Data columns (total 2 columns):
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 152.0+ bytes

In [240]:
df.count()

Capital       3
Population    3
dtype: int64

### Summary

In [242]:
df.sum()

Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [243]:
df.cumsum()

                           Capital  Population
Country
Belgium                   Brussels    11190846
India            BrusselsNew Delhi  1314361881
Brazil   BrusselsNew DelhiBrasília  1522209409

In [245]:
#df.min()/df.max()

In [247]:
#df.idxmin()/df.idxmax()

In [248]:
 df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [249]:
df.mean()

Population    5.074031e+08
dtype: float64

In [250]:
df.median()

Population    207847528.0
dtype: float64

## Aplicando funciones

In [251]:
 f = lambda x: x*2

In [252]:
 df.apply(f)

                    Capital  Population
Country
Belgium    BrusselsBrussels    22381692
India    New DelhiNew Delhi  2606342070
Brazil     BrasíliaBrasília   415695056

In [253]:
 df.applymap(f)

                    Capital  Population
Country
Belgium    BrusselsBrussels    22381692
India    New DelhiNew Delhi  2606342070
Brazil     BrasíliaBrasília   415695056

## Alineamiento de datos

### Alineamiento de datos internos

In [254]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])

In [255]:
s + s3

a    13.0
b     NaN
c     5.0
d     7.0
dtype: float64

## Operaciones aritméticas con métodos llenos

In [257]:
 s.add(s3, fill_value=0)

a    13.0
b    -5.0
c     5.0
d     7.0
dtype: float64

In [258]:
s.sub(s3, fill_value=2)

a   -1.0
b   -7.0
c    9.0
d    1.0
dtype: float64

In [259]:
 s.div(s3, fill_value=4)

a    0.857143
b   -1.250000
c   -3.500000
d    1.333333
dtype: float64

In [260]:
s.mul(s3, fill_value=3)

a    42.0
b   -15.0
c   -14.0
d    12.0
dtype: float64

# Segunda parte de los trucos de la librería Pandas

## Remodelación de datos

### Creación de los datos

In [273]:
data = {'Date': ['2016-03-01','2016-03-02','2016-03-01','2016-03-03','2016-03-02','2016-03-03'],
        'Type': ['a','b','c','a','a','c'],
        'Value': [11.432,13.031,20.784,99.906,1.303,20.784]}

df2 = pd.DataFrame(data,
 columns=['Date', 'Type', 'Value'])

### Pivote

In [274]:
df3 = df2.pivot(index='Date', columns='Type',values='Value')

### Tabla pivote

In [275]:
df4 = pd.pivot_table(df2, values='Value',index='Date',columns='Type')

### pilar/desapilar

In [279]:
stacked = df4.stack()
stacked.unstack()

Type             a       b       c
Date
2016-03-01  11.432     NaN  20.784
2016-03-02   1.303  13.031     NaN
2016-03-03  99.906     NaN  20.784

### Derretir

In [281]:
pd.melt(df2,
        id_vars=["Date"],
        value_vars=["Type","Value"],
        value_name="Observations")

          Date variable Observations
0   2016-03-01     Type            a
1   2016-03-02     Type            b
2   2016-03-01     Type            c
3   2016-03-03     Type            a
4   2016-03-02     Type            a
5   2016-03-03     Type            c
6   2016-03-01    Value       11.432
7   2016-03-02    Value       13.031
8   2016-03-01    Value       20.784
9   2016-03-03    Value       99.906
10  2016-03-02    Value        1.303
11  2016-03-03    Value       20.784

### Iteración